analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/pwrseq_regs.h
/**
 * @file    pwrseq_regs.h
 * @brief   Registers, Bit Masks and Bit Positions for the PWRSEQ Peripheral Module.
 * @note    This file is @generated.
 * @ingroup pwrseq_registers
 */

/******************************************************************************
 *
 * Copyright 2023 Analog Devices, Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************
 *
 * Copyright (C) 2023 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 ******************************************************************************/

#ifndef LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32650_INCLUDE_PWRSEQ_REGS_H_
#define LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32650_INCLUDE_PWRSEQ_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined (__ICCARM__)
  #pragma system_include
#endif

#if defined (__CC_ARM)
  #pragma anon_unions
#endif
/// @cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
/// @endcond

/* **** Definitions **** */

/**
 * @ingroup     pwrseq
 * @defgroup    pwrseq_registers PWRSEQ_Registers
 * @brief       Registers, Bit Masks and Bit Positions for the PWRSEQ Peripheral Module.
 * @details     Power Sequencer / Low Power Control Register.
 */

/**
 * @ingroup pwrseq_registers
 * Structure type to access the PWRSEQ Registers.
 */
typedef struct {
    __IO uint32_t ctrl;                 /**< <tt>\b 0x00:</tt> PWRSEQ CTRL Register */
    __IO uint32_t gpio0_wk_fl;          /**< <tt>\b 0x04:</tt> PWRSEQ GPIO0_WK_FL Register */
    __IO uint32_t gpio0_wk_en;          /**< <tt>\b 0x08:</tt> PWRSEQ GPIO0_WK_EN Register */
    __IO uint32_t gpio1_wk_fl;          /**< <tt>\b 0x0C:</tt> PWRSEQ GPIO1_WK_FL Register */
    __IO uint32_t gpio1_wk_en;          /**< <tt>\b 0x10:</tt> PWRSEQ GPIO1_WK_EN Register */
    __IO uint32_t gpio2_wk_fl;          /**< <tt>\b 0x14:</tt> PWRSEQ GPIO2_WK_FL Register */
    __IO uint32_t gpio2_wk_en;          /**< <tt>\b 0x18:</tt> PWRSEQ GPIO2_WK_EN Register */
    __IO uint32_t gpio3_wk_fl;          /**< <tt>\b 0x1C:</tt> PWRSEQ GPIO3_WK_FL Register */
    __IO uint32_t gpio3_wk_en;          /**< <tt>\b 0x20:</tt> PWRSEQ GPIO3_WK_EN Register */
    __R  uint32_t rsv_0x24_0x2f[3];
    __IO uint32_t usb_wk_fl;            /**< <tt>\b 0x30:</tt> PWRSEQ USB_WK_FL Register */
    __IO uint32_t usb_wk_en;            /**< <tt>\b 0x34:</tt> PWRSEQ USB_WK_EN Register */
    __R  uint32_t rsv_0x38_0x3f[2];
    __IO uint32_t mem_pwr;              /**< <tt>\b 0x40:</tt> PWRSEQ MEM_PWR Register */
} mxc_pwrseq_regs_t;

/* Register offsets for module PWRSEQ */
/**
 * @ingroup    pwrseq_registers
 * @defgroup   PWRSEQ_Register_Offsets Register Offsets
 * @brief      PWRSEQ Peripheral Register Offsets from the PWRSEQ Base Peripheral Address.
 * @{
 */
#define MXC_R_PWRSEQ_CTRL                  ((uint32_t)0x00000000UL) /**< Offset from PWRSEQ Base Address: <tt> 0x0000</tt> */
#define MXC_R_PWRSEQ_GPIO0_WK_FL           ((uint32_t)0x00000004UL) /**< Offset from PWRSEQ Base Address: <tt> 0x0004</tt> */
#define MXC_R_PWRSEQ_GPIO0_WK_EN           ((uint32_t)0x00000008UL) /**< Offset from PWRSEQ Base Address: <tt> 0x0008</tt> */
#define MXC_R_PWRSEQ_GPIO1_WK_FL           ((uint32_t)0x0000000CUL) /**< Offset from PWRSEQ Base Address: <tt> 0x000C</tt> */
#define MXC_R_PWRSEQ_GPIO1_WK_EN           ((uint32_t)0x00000010UL) /**< Offset from PWRSEQ Base Address: <tt> 0x0010</tt> */
#define MXC_R_PWRSEQ_GPIO2_WK_FL           ((uint32_t)0x00000014UL) /**< Offset from PWRSEQ Base Address: <tt> 0x0014</tt> */
#define MXC_R_PWRSEQ_GPIO2_WK_EN           ((uint32_t)0x00000018UL) /**< Offset from PWRSEQ Base Address: <tt> 0x0018</tt> */
#define MXC_R_PWRSEQ_GPIO3_WK_FL           ((uint32_t)0x0000001CUL) /**< Offset from PWRSEQ Base Address: <tt> 0x001C</tt> */
#define MXC_R_PWRSEQ_GPIO3_WK_EN           ((uint32_t)0x00000020UL) /**< Offset from PWRSEQ Base Address: <tt> 0x0020</tt> */
#define MXC_R_PWRSEQ_USB_WK_FL             ((uint32_t)0x00000030UL) /**< Offset from PWRSEQ Base Address: <tt> 0x0030</tt> */
#define MXC_R_PWRSEQ_USB_WK_EN             ((uint32_t)0x00000034UL) /**< Offset from PWRSEQ Base Address: <tt> 0x0034</tt> */
#define MXC_R_PWRSEQ_MEM_PWR               ((uint32_t)0x00000040UL) /**< Offset from PWRSEQ Base Address: <tt> 0x0040</tt> */
/**@} end of group pwrseq_registers */

/**
 * @ingroup  pwrseq_registers
 * @defgroup PWRSEQ_CTRL PWRSEQ_CTRL
 * @brief    Low Power Control Register.
 * @{
 */
#define MXC_F_PWRSEQ_CTRL_RAMRET_POS                   0 /**< CTRL_RAMRET Position */
#define MXC_F_PWRSEQ_CTRL_RAMRET                       ((uint32_t)(0x3UL << MXC_F_PWRSEQ_CTRL_RAMRET_POS)) /**< CTRL_RAMRET Mask */
#define MXC_V_PWRSEQ_CTRL_RAMRET_DIS                   ((uint32_t)0x0UL) /**< CTRL_RAMRET_DIS Value */
#define MXC_S_PWRSEQ_CTRL_RAMRET_DIS                   (MXC_V_PWRSEQ_CTRL_RAMRET_DIS << MXC_F_PWRSEQ_CTRL_RAMRET_POS) /**< CTRL_RAMRET_DIS Setting */
#define MXC_V_PWRSEQ_CTRL_RAMRET_EN1                   ((uint32_t)0x1UL) /**< CTRL_RAMRET_EN1 Value */
#define MXC_S_PWRSEQ_CTRL_RAMRET_EN1                   (MXC_V_PWRSEQ_CTRL_RAMRET_EN1 << MXC_F_PWRSEQ_CTRL_RAMRET_POS) /**< CTRL_RAMRET_EN1 Setting */
#define MXC_V_PWRSEQ_CTRL_RAMRET_EN2                   ((uint32_t)0x2UL) /**< CTRL_RAMRET_EN2 Value */
#define MXC_S_PWRSEQ_CTRL_RAMRET_EN2                   (MXC_V_PWRSEQ_CTRL_RAMRET_EN2 << MXC_F_PWRSEQ_CTRL_RAMRET_POS) /**< CTRL_RAMRET_EN2 Setting */
#define MXC_V_PWRSEQ_CTRL_RAMRET_EN3                   ((uint32_t)0x3UL) /**< CTRL_RAMRET_EN3 Value */
#define MXC_S_PWRSEQ_CTRL_RAMRET_EN3                   (MXC_V_PWRSEQ_CTRL_RAMRET_EN3 << MXC_F_PWRSEQ_CTRL_RAMRET_POS) /**< CTRL_RAMRET_EN3 Setting */

#define MXC_F_PWRSEQ_CTRL_RREGEN_POS                   8 /**< CTRL_RREGEN Position */
#define MXC_F_PWRSEQ_CTRL_RREGEN                       ((uint32_t)(0x1UL << MXC_F_PWRSEQ_CTRL_RREGEN_POS)) /**< CTRL_RREGEN Mask */
#define MXC_V_PWRSEQ_CTRL_RREGEN_DIS                   ((uint32_t)0x0UL) /**< CTRL_RREGEN_DIS Value */
#define MXC_S_PWRSEQ_CTRL_RREGEN_DIS                   (MXC_V_PWRSEQ_CTRL_RREGEN_DIS << MXC_F_PWRSEQ_CTRL_RREGEN_POS) /**< CTRL_RREGEN_DIS Setting */
#define MXC_V_PWRSEQ_CTRL_RREGEN_EN                    ((uint32_t)0x1UL) /**< CTRL_RREGEN_EN Value */
#define MXC_S_PWRSEQ_CTRL_RREGEN_EN                    (MXC_V_PWRSEQ_CTRL_RREGEN_EN << MXC_F_PWRSEQ_CTRL_RREGEN_POS) /**< CTRL_RREGEN_EN Setting */

#define MXC_F_PWRSEQ_CTRL_BKGRND_POS                   9 /**< CTRL_BKGRND Position */
#define MXC_F_PWRSEQ_CTRL_BKGRND                       ((uint32_t)(0x1UL << MXC_F_PWRSEQ_CTRL_BKGRND_POS)) /**< CTRL_BKGRND Mask */
#define MXC_V_PWRSEQ_CTRL_BKGRND_DIS                   ((uint32_t)0x0UL) /**< CTRL_BKGRND_DIS Value */
#define MXC_S_PWRSEQ_CTRL_BKGRND_DIS                   (MXC_V_PWRSEQ_CTRL_BKGRND_DIS << MXC_F_PWRSEQ_CTRL_BKGRND_POS) /**< CTRL_BKGRND_DIS Setting */
#define MXC_V_PWRSEQ_CTRL_BKGRND_EN                    ((uint32_t)0x1UL) /**< CTRL_BKGRND_EN Value */
#define MXC_S_PWRSEQ_CTRL_BKGRND_EN                    (MXC_V_PWRSEQ_CTRL_BKGRND_EN << MXC_F_PWRSEQ_CTRL_BKGRND_POS) /**< CTRL_BKGRND_EN Setting */

#define MXC_F_PWRSEQ_CTRL_FWKM_POS                     10 /**< CTRL_FWKM Position */
#define MXC_F_PWRSEQ_CTRL_FWKM                         ((uint32_t)(0x1UL << MXC_F_PWRSEQ_CTRL_FWKM_POS)) /**< CTRL_FWKM Mask */
#define MXC_V_PWRSEQ_CTRL_FWKM_DIS                     ((uint32_t)0x0UL) /**< CTRL_FWKM_DIS Value */
#define MXC_S_PWRSEQ_CTRL_FWKM_DIS                     (MXC_V_PWRSEQ_CTRL_FWKM_DIS << MXC_F_PWRSEQ_CTRL_FWKM_POS) /**< CTRL_FWKM_DIS Setting */
#define MXC_V_PWRSEQ_CTRL_FWKM_EN                      ((uint32_t)0x1UL) /**< CTRL_FWKM_EN Value */
#define MXC_S_PWRSEQ_CTRL_FWKM_EN                      (MXC_V_PWRSEQ_CTRL_FWKM_EN << MXC_F_PWRSEQ_CTRL_FWKM_POS) /**< CTRL_FWKM_EN Setting */

#define MXC_F_PWRSEQ_CTRL_BGOFF_POS                    11 /**< CTRL_BGOFF Position */
#define MXC_F_PWRSEQ_CTRL_BGOFF                        ((uint32_t)(0x1UL << MXC_F_PWRSEQ_CTRL_BGOFF_POS)) /**< CTRL_BGOFF Mask */
#define MXC_V_PWRSEQ_CTRL_BGOFF_ON                     ((uint32_t)0x0UL) /**< CTRL_BGOFF_ON Value */
#define MXC_S_PWRSEQ_CTRL_BGOFF_ON                     (MXC_V_PWRSEQ_CTRL_BGOFF_ON << MXC_F_PWRSEQ_CTRL_BGOFF_POS) /**< CTRL_BGOFF_ON Setting */
#define MXC_V_PWRSEQ_CTRL_BGOFF_OFF                    ((uint32_t)0x1UL) /**< CTRL_BGOFF_OFF Value */
#define MXC_S_PWRSEQ_CTRL_BGOFF_OFF                    (MXC_V_PWRSEQ_CTRL_BGOFF_OFF << MXC_F_PWRSEQ_CTRL_BGOFF_POS) /**< CTRL_BGOFF_OFF Setting */

#define MXC_F_PWRSEQ_CTRL_PORVCOREMD_POS               12 /**< CTRL_PORVCOREMD Position */
#define MXC_F_PWRSEQ_CTRL_PORVCOREMD                   ((uint32_t)(0x1UL << MXC_F_PWRSEQ_CTRL_PORVCOREMD_POS)) /**< CTRL_PORVCOREMD Mask */
#define MXC_V_PWRSEQ_CTRL_PORVCOREMD_EN                ((uint32_t)0x0UL) /**< CTRL_PORVCOREMD_EN Value */
#define MXC_S_PWRSEQ_CTRL_PORVCOREMD_EN                (MXC_V_PWRSEQ_CTRL_PORVCOREMD_EN << MXC_F_PWRSEQ_CTRL_PORVCOREMD_POS) /**< CTRL_PORVCOREMD_EN Setting */
#define MXC_V_PWRSEQ_CTRL_PORVCOREMD_DIS               ((uint32_t)0x1UL) /**< CTRL_PORVCOREMD_DIS Value */
#define MXC_S_PWRSEQ_CTRL_PORVCOREMD_DIS               (MXC_V_PWRSEQ_CTRL_PORVCOREMD_DIS << MXC_F_PWRSEQ_CTRL_PORVCOREMD_POS) /**< CTRL_PORVCOREMD_DIS Setting */

#define MXC_F_PWRSEQ_CTRL_VCOREMD_POS                  20 /**< CTRL_VCOREMD Position */
#define MXC_F_PWRSEQ_CTRL_VCOREMD                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_CTRL_VCOREMD_POS)) /**< CTRL_VCOREMD Mask */
#define MXC_V_PWRSEQ_CTRL_VCOREMD_EN                   ((uint32_t)0x0UL) /**< CTRL_VCOREMD_EN Value */
#define MXC_S_PWRSEQ_CTRL_VCOREMD_EN                   (MXC_V_PWRSEQ_CTRL_VCOREMD_EN << MXC_F_PWRSEQ_CTRL_VCOREMD_POS) /**< CTRL_VCOREMD_EN Setting */
#define MXC_V_PWRSEQ_CTRL_VCOREMD_DIS                  ((uint32_t)0x1UL) /**< CTRL_VCOREMD_DIS Value */
#define MXC_S_PWRSEQ_CTRL_VCOREMD_DIS                  (MXC_V_PWRSEQ_CTRL_VCOREMD_DIS << MXC_F_PWRSEQ_CTRL_VCOREMD_POS) /**< CTRL_VCOREMD_DIS Setting */

#define MXC_F_PWRSEQ_CTRL_VRTCMD_POS                   21 /**< CTRL_VRTCMD Position */
#define MXC_F_PWRSEQ_CTRL_VRTCMD                       ((uint32_t)(0x1UL << MXC_F_PWRSEQ_CTRL_VRTCMD_POS)) /**< CTRL_VRTCMD Mask */
#define MXC_V_PWRSEQ_CTRL_VRTCMD_EN                    ((uint32_t)0x0UL) /**< CTRL_VRTCMD_EN Value */
#define MXC_S_PWRSEQ_CTRL_VRTCMD_EN                    (MXC_V_PWRSEQ_CTRL_VRTCMD_EN << MXC_F_PWRSEQ_CTRL_VRTCMD_POS) /**< CTRL_VRTCMD_EN Setting */
#define MXC_V_PWRSEQ_CTRL_VRTCMD_DIS                   ((uint32_t)0x1UL) /**< CTRL_VRTCMD_DIS Value */
#define MXC_S_PWRSEQ_CTRL_VRTCMD_DIS                   (MXC_V_PWRSEQ_CTRL_VRTCMD_DIS << MXC_F_PWRSEQ_CTRL_VRTCMD_POS) /**< CTRL_VRTCMD_DIS Setting */

#define MXC_F_PWRSEQ_CTRL_VDDAMD_POS                   22 /**< CTRL_VDDAMD Position */
#define MXC_F_PWRSEQ_CTRL_VDDAMD                       ((uint32_t)(0x1UL << MXC_F_PWRSEQ_CTRL_VDDAMD_POS)) /**< CTRL_VDDAMD Mask */
#define MXC_V_PWRSEQ_CTRL_VDDAMD_EN                    ((uint32_t)0x0UL) /**< CTRL_VDDAMD_EN Value */
#define MXC_S_PWRSEQ_CTRL_VDDAMD_EN                    (MXC_V_PWRSEQ_CTRL_VDDAMD_EN << MXC_F_PWRSEQ_CTRL_VDDAMD_POS) /**< CTRL_VDDAMD_EN Setting */
#define MXC_V_PWRSEQ_CTRL_VDDAMD_DIS                   ((uint32_t)0x1UL) /**< CTRL_VDDAMD_DIS Value */
#define MXC_S_PWRSEQ_CTRL_VDDAMD_DIS                   (MXC_V_PWRSEQ_CTRL_VDDAMD_DIS << MXC_F_PWRSEQ_CTRL_VDDAMD_POS) /**< CTRL_VDDAMD_DIS Setting */

#define MXC_F_PWRSEQ_CTRL_VDDIOMD_POS                  23 /**< CTRL_VDDIOMD Position */
#define MXC_F_PWRSEQ_CTRL_VDDIOMD                      ((uint32_t)(0x1UL << MXC_F_PWRSEQ_CTRL_VDDIOMD_POS)) /**< CTRL_VDDIOMD Mask */
#define MXC_V_PWRSEQ_CTRL_VDDIOMD_EN                   ((uint32_t)0x0UL) /**< CTRL_VDDIOMD_EN Value */
#define MXC_S_PWRSEQ_CTRL_VDDIOMD_EN                   (MXC_V_PWRSEQ_CTRL_VDDIOMD_EN << MXC_F_PWRSEQ_CTRL_VDDIOMD_POS) /**< CTRL_VDDIOMD_EN Setting */
#define MXC_V_PWRSEQ_CTRL_VDDIOMD_DIS                  ((uint32_t)0x1UL) /**< CTRL_VDDIOMD_DIS Value */
#define MXC_S_PWRSEQ_CTRL_VDDIOMD_DIS                  (MXC_V_PWRSEQ_CTRL_VDDIOMD_DIS << MXC_F_PWRSEQ_CTRL_VDDIOMD_POS) /**< CTRL_VDDIOMD_DIS Setting */

