analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/pwrseq_regs.h
#define MXC_F_PWRSEQ_CTRL_VDDIOHMD_POS                 24 /**< CTRL_VDDIOHMD Position */
#define MXC_F_PWRSEQ_CTRL_VDDIOHMD                     ((uint32_t)(0x1UL << MXC_F_PWRSEQ_CTRL_VDDIOHMD_POS)) /**< CTRL_VDDIOHMD Mask */
#define MXC_V_PWRSEQ_CTRL_VDDIOHMD_EN                  ((uint32_t)0x0UL) /**< CTRL_VDDIOHMD_EN Value */
#define MXC_S_PWRSEQ_CTRL_VDDIOHMD_EN                  (MXC_V_PWRSEQ_CTRL_VDDIOHMD_EN << MXC_F_PWRSEQ_CTRL_VDDIOHMD_POS) /**< CTRL_VDDIOHMD_EN Setting */
#define MXC_V_PWRSEQ_CTRL_VDDIOHMD_DIS                 ((uint32_t)0x1UL) /**< CTRL_VDDIOHMD_DIS Value */
#define MXC_S_PWRSEQ_CTRL_VDDIOHMD_DIS                 (MXC_V_PWRSEQ_CTRL_VDDIOHMD_DIS << MXC_F_PWRSEQ_CTRL_VDDIOHMD_POS) /**< CTRL_VDDIOHMD_DIS Setting */

#define MXC_F_PWRSEQ_CTRL_PORVDDIOMD_POS               25 /**< CTRL_PORVDDIOMD Position */
#define MXC_F_PWRSEQ_CTRL_PORVDDIOMD                   ((uint32_t)(0x1UL << MXC_F_PWRSEQ_CTRL_PORVDDIOMD_POS)) /**< CTRL_PORVDDIOMD Mask */
#define MXC_V_PWRSEQ_CTRL_PORVDDIOMD_EN                ((uint32_t)0x0UL) /**< CTRL_PORVDDIOMD_EN Value */
#define MXC_S_PWRSEQ_CTRL_PORVDDIOMD_EN                (MXC_V_PWRSEQ_CTRL_PORVDDIOMD_EN << MXC_F_PWRSEQ_CTRL_PORVDDIOMD_POS) /**< CTRL_PORVDDIOMD_EN Setting */
#define MXC_V_PWRSEQ_CTRL_PORVDDIOMD_DIS               ((uint32_t)0x1UL) /**< CTRL_PORVDDIOMD_DIS Value */
#define MXC_S_PWRSEQ_CTRL_PORVDDIOMD_DIS               (MXC_V_PWRSEQ_CTRL_PORVDDIOMD_DIS << MXC_F_PWRSEQ_CTRL_PORVDDIOMD_POS) /**< CTRL_PORVDDIOMD_DIS Setting */

#define MXC_F_PWRSEQ_CTRL_PORVDDIOHMD_POS              26 /**< CTRL_PORVDDIOHMD Position */
#define MXC_F_PWRSEQ_CTRL_PORVDDIOHMD                  ((uint32_t)(0x1UL << MXC_F_PWRSEQ_CTRL_PORVDDIOHMD_POS)) /**< CTRL_PORVDDIOHMD Mask */
#define MXC_V_PWRSEQ_CTRL_PORVDDIOHMD_EN               ((uint32_t)0x0UL) /**< CTRL_PORVDDIOHMD_EN Value */
#define MXC_S_PWRSEQ_CTRL_PORVDDIOHMD_EN               (MXC_V_PWRSEQ_CTRL_PORVDDIOHMD_EN << MXC_F_PWRSEQ_CTRL_PORVDDIOHMD_POS) /**< CTRL_PORVDDIOHMD_EN Setting */
#define MXC_V_PWRSEQ_CTRL_PORVDDIOHMD_DIS              ((uint32_t)0x1UL) /**< CTRL_PORVDDIOHMD_DIS Value */
#define MXC_S_PWRSEQ_CTRL_PORVDDIOHMD_DIS              (MXC_V_PWRSEQ_CTRL_PORVDDIOHMD_DIS << MXC_F_PWRSEQ_CTRL_PORVDDIOHMD_POS) /**< CTRL_PORVDDIOHMD_DIS Setting */

#define MXC_F_PWRSEQ_CTRL_VDDBMD_POS                   27 /**< CTRL_VDDBMD Position */
#define MXC_F_PWRSEQ_CTRL_VDDBMD                       ((uint32_t)(0x1UL << MXC_F_PWRSEQ_CTRL_VDDBMD_POS)) /**< CTRL_VDDBMD Mask */
#define MXC_V_PWRSEQ_CTRL_VDDBMD_EN                    ((uint32_t)0x0UL) /**< CTRL_VDDBMD_EN Value */
#define MXC_S_PWRSEQ_CTRL_VDDBMD_EN                    (MXC_V_PWRSEQ_CTRL_VDDBMD_EN << MXC_F_PWRSEQ_CTRL_VDDBMD_POS) /**< CTRL_VDDBMD_EN Setting */
#define MXC_V_PWRSEQ_CTRL_VDDBMD_DIS                   ((uint32_t)0x1UL) /**< CTRL_VDDBMD_DIS Value */
#define MXC_S_PWRSEQ_CTRL_VDDBMD_DIS                   (MXC_V_PWRSEQ_CTRL_VDDBMD_DIS << MXC_F_PWRSEQ_CTRL_VDDBMD_POS) /**< CTRL_VDDBMD_DIS Setting */

/**@} end of group PWRSEQ_CTRL_Register */

/**
 * @ingroup  pwrseq_registers
 * @defgroup PWRSEQ_GPIO0_WK_FL PWRSEQ_GPIO0_WK_FL
 * @brief    Low Power I/O Wakeup Status Register 0. This register indicates the low power
 *           wakeup status for GPIO0.
 * @{
 */
#define MXC_F_PWRSEQ_GPIO0_WK_FL_WAKEST_POS            0 /**< GPIO0_WK_FL_WAKEST Position */
#define MXC_F_PWRSEQ_GPIO0_WK_FL_WAKEST                ((uint32_t)(0xFFFFFFFFUL << MXC_F_PWRSEQ_GPIO0_WK_FL_WAKEST_POS)) /**< GPIO0_WK_FL_WAKEST Mask */

/**@} end of group PWRSEQ_GPIO0_WK_FL_Register */

/**
 * @ingroup  pwrseq_registers
 * @defgroup PWRSEQ_GPIO0_WK_EN PWRSEQ_GPIO0_WK_EN
 * @brief    Low Power I/O Wakeup Enable Register 0. This register enables low power wakeup
 *           functionality for GPIO0.
 * @{
 */
#define MXC_F_PWRSEQ_GPIO0_WK_EN_WAKEEN_POS            0 /**< GPIO0_WK_EN_WAKEEN Position */
#define MXC_F_PWRSEQ_GPIO0_WK_EN_WAKEEN                ((uint32_t)(0xFFFFFFFFUL << MXC_F_PWRSEQ_GPIO0_WK_EN_WAKEEN_POS)) /**< GPIO0_WK_EN_WAKEEN Mask */

/**@} end of group PWRSEQ_GPIO0_WK_EN_Register */

/**
 * @ingroup  pwrseq_registers
 * @defgroup PWRSEQ_GPIO1_WK_FL PWRSEQ_GPIO1_WK_FL
 * @brief    Low Power I/O Wakeup Status Register 1. This register indicates the low power
 *           wakeup status for GPIO1.
 * @{
 */
#define MXC_F_PWRSEQ_GPIO1_WK_FL_WAKEST_POS            0 /**< GPIO1_WK_FL_WAKEST Position */
#define MXC_F_PWRSEQ_GPIO1_WK_FL_WAKEST                ((uint32_t)(0xFFFFFFFFUL << MXC_F_PWRSEQ_GPIO1_WK_FL_WAKEST_POS)) /**< GPIO1_WK_FL_WAKEST Mask */

/**@} end of group PWRSEQ_GPIO1_WK_FL_Register */

/**
 * @ingroup  pwrseq_registers
 * @defgroup PWRSEQ_GPIO1_WK_EN PWRSEQ_GPIO1_WK_EN
 * @brief    Low Power I/O Wakeup Enable Register 1. This register enables low power wakeup
 *           functionality for GPIO1.
 * @{
 */
#define MXC_F_PWRSEQ_GPIO1_WK_EN_WAKEEN_POS            0 /**< GPIO1_WK_EN_WAKEEN Position */
#define MXC_F_PWRSEQ_GPIO1_WK_EN_WAKEEN                ((uint32_t)(0xFFFFFFFFUL << MXC_F_PWRSEQ_GPIO1_WK_EN_WAKEEN_POS)) /**< GPIO1_WK_EN_WAKEEN Mask */

/**@} end of group PWRSEQ_GPIO1_WK_EN_Register */

/**
 * @ingroup  pwrseq_registers
 * @defgroup PWRSEQ_GPIO2_WK_FL PWRSEQ_GPIO2_WK_FL
 * @brief    Low Power I/O Wakeup Status Register 0. This register indicates the low power
 *           wakeup status for GPIO2.
 * @{
 */
#define MXC_F_PWRSEQ_GPIO2_WK_FL_WAKEST_POS            0 /**< GPIO2_WK_FL_WAKEST Position */
#define MXC_F_PWRSEQ_GPIO2_WK_FL_WAKEST                ((uint32_t)(0xFFFFFFFFUL << MXC_F_PWRSEQ_GPIO2_WK_FL_WAKEST_POS)) /**< GPIO2_WK_FL_WAKEST Mask */

/**@} end of group PWRSEQ_GPIO2_WK_FL_Register */

/**
 * @ingroup  pwrseq_registers
 * @defgroup PWRSEQ_GPIO2_WK_EN PWRSEQ_GPIO2_WK_EN
 * @brief    Low Power I/O Wakeup Enable Register 0. This register enables low power wakeup
 *           functionality for GPIO0.
 * @{
 */
#define MXC_F_PWRSEQ_GPIO2_WK_EN_WAKEEN_POS            0 /**< GPIO2_WK_EN_WAKEEN Position */
#define MXC_F_PWRSEQ_GPIO2_WK_EN_WAKEEN                ((uint32_t)(0xFFFFFFFFUL << MXC_F_PWRSEQ_GPIO2_WK_EN_WAKEEN_POS)) /**< GPIO2_WK_EN_WAKEEN Mask */

/**@} end of group PWRSEQ_GPIO2_WK_EN_Register */

/**
 * @ingroup  pwrseq_registers
 * @defgroup PWRSEQ_GPIO3_WK_FL PWRSEQ_GPIO3_WK_FL
 * @brief    Low Power I/O Wakeup Status Register 0. This register indicates the low power
 *           wakeup status for GPIO3.
 * @{
 */
#define MXC_F_PWRSEQ_GPIO3_WK_FL_WAKEST_POS            0 /**< GPIO3_WK_FL_WAKEST Position */
#define MXC_F_PWRSEQ_GPIO3_WK_FL_WAKEST                ((uint32_t)(0x3FFUL << MXC_F_PWRSEQ_GPIO3_WK_FL_WAKEST_POS)) /**< GPIO3_WK_FL_WAKEST Mask */

/**@} end of group PWRSEQ_GPIO3_WK_FL_Register */

/**
 * @ingroup  pwrseq_registers
 * @defgroup PWRSEQ_GPIO3_WK_EN PWRSEQ_GPIO3_WK_EN
 * @brief    Low Power I/O Wakeup Enable Register 0. This register enables low power wakeup
 *           functionality for GPIO3.
 * @{
 */
#define MXC_F_PWRSEQ_GPIO3_WK_EN_WAKEEN_POS            0 /**< GPIO3_WK_EN_WAKEEN Position */
#define MXC_F_PWRSEQ_GPIO3_WK_EN_WAKEEN                ((uint32_t)(0x3FFUL << MXC_F_PWRSEQ_GPIO3_WK_EN_WAKEEN_POS)) /**< GPIO3_WK_EN_WAKEEN Mask */

/**@} end of group PWRSEQ_GPIO3_WK_EN_Register */

/**
 * @ingroup  pwrseq_registers
 * @defgroup PWRSEQ_USB_WK_FL PWRSEQ_USB_WK_FL
 * @brief    Low Power Peripheral Wakeup Status Register.
 * @{
 */
#define MXC_F_PWRSEQ_USB_WK_FL_USBLSWKST_POS           0 /**< USB_WK_FL_USBLSWKST Position */
#define MXC_F_PWRSEQ_USB_WK_FL_USBLSWKST               ((uint32_t)(0x3UL << MXC_F_PWRSEQ_USB_WK_FL_USBLSWKST_POS)) /**< USB_WK_FL_USBLSWKST Mask */
#define MXC_V_PWRSEQ_USB_WK_FL_USBLSWKST_DPLUS         ((uint32_t)0x0UL) /**< USB_WK_FL_USBLSWKST_DPLUS Value */
#define MXC_S_PWRSEQ_USB_WK_FL_USBLSWKST_DPLUS         (MXC_V_PWRSEQ_USB_WK_FL_USBLSWKST_DPLUS << MXC_F_PWRSEQ_USB_WK_FL_USBLSWKST_POS) /**< USB_WK_FL_USBLSWKST_DPLUS Setting */
#define MXC_V_PWRSEQ_USB_WK_FL_USBLSWKST_DMINUS        ((uint32_t)0x1UL) /**< USB_WK_FL_USBLSWKST_DMINUS Value */
#define MXC_S_PWRSEQ_USB_WK_FL_USBLSWKST_DMINUS        (MXC_V_PWRSEQ_USB_WK_FL_USBLSWKST_DMINUS << MXC_F_PWRSEQ_USB_WK_FL_USBLSWKST_POS) /**< USB_WK_FL_USBLSWKST_DMINUS Setting */

#define MXC_F_PWRSEQ_USB_WK_FL_USBVBUSWKST_POS         2 /**< USB_WK_FL_USBVBUSWKST Position */
#define MXC_F_PWRSEQ_USB_WK_FL_USBVBUSWKST             ((uint32_t)(0x1UL << MXC_F_PWRSEQ_USB_WK_FL_USBVBUSWKST_POS)) /**< USB_WK_FL_USBVBUSWKST Mask */
#define MXC_V_PWRSEQ_USB_WK_FL_USBVBUSWKST_NORMAL      ((uint32_t)0x0UL) /**< USB_WK_FL_USBVBUSWKST_NORMAL Value */
#define MXC_S_PWRSEQ_USB_WK_FL_USBVBUSWKST_NORMAL      (MXC_V_PWRSEQ_USB_WK_FL_USBVBUSWKST_NORMAL << MXC_F_PWRSEQ_USB_WK_FL_USBVBUSWKST_POS) /**< USB_WK_FL_USBVBUSWKST_NORMAL Setting */
#define MXC_V_PWRSEQ_USB_WK_FL_USBVBUSWKST_STCHNG      ((uint32_t)0x1UL) /**< USB_WK_FL_USBVBUSWKST_STCHNG Value */
#define MXC_S_PWRSEQ_USB_WK_FL_USBVBUSWKST_STCHNG      (MXC_V_PWRSEQ_USB_WK_FL_USBVBUSWKST_STCHNG << MXC_F_PWRSEQ_USB_WK_FL_USBVBUSWKST_POS) /**< USB_WK_FL_USBVBUSWKST_STCHNG Setting */

/**@} end of group PWRSEQ_USB_WK_FL_Register */

/**
 * @ingroup  pwrseq_registers
 * @defgroup PWRSEQ_USB_WK_EN PWRSEQ_USB_WK_EN
 * @brief    Low Power Peripheral Wakeup Enable Register.
 * @{
 */
#define MXC_F_PWRSEQ_USB_WK_EN_USBLSWKEN_POS           0 /**< USB_WK_EN_USBLSWKEN Position */
#define MXC_F_PWRSEQ_USB_WK_EN_USBLSWKEN               ((uint32_t)(0x3UL << MXC_F_PWRSEQ_USB_WK_EN_USBLSWKEN_POS)) /**< USB_WK_EN_USBLSWKEN Mask */
#define MXC_V_PWRSEQ_USB_WK_EN_USBLSWKEN_DIS           ((uint32_t)0x0UL) /**< USB_WK_EN_USBLSWKEN_DIS Value */
#define MXC_S_PWRSEQ_USB_WK_EN_USBLSWKEN_DIS           (MXC_V_PWRSEQ_USB_WK_EN_USBLSWKEN_DIS << MXC_F_PWRSEQ_USB_WK_EN_USBLSWKEN_POS) /**< USB_WK_EN_USBLSWKEN_DIS Setting */
#define MXC_V_PWRSEQ_USB_WK_EN_USBLSWKEN_EN            ((uint32_t)0x3UL) /**< USB_WK_EN_USBLSWKEN_EN Value */
#define MXC_S_PWRSEQ_USB_WK_EN_USBLSWKEN_EN            (MXC_V_PWRSEQ_USB_WK_EN_USBLSWKEN_EN << MXC_F_PWRSEQ_USB_WK_EN_USBLSWKEN_POS) /**< USB_WK_EN_USBLSWKEN_EN Setting */

