analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/pwrseq_regs.h
#define MXC_F_PWRSEQ_USB_WK_EN_USBVBUSWKEN_POS         2 /**< USB_WK_EN_USBVBUSWKEN Position */
#define MXC_F_PWRSEQ_USB_WK_EN_USBVBUSWKEN             ((uint32_t)(0x1UL << MXC_F_PWRSEQ_USB_WK_EN_USBVBUSWKEN_POS)) /**< USB_WK_EN_USBVBUSWKEN Mask */
#define MXC_V_PWRSEQ_USB_WK_EN_USBVBUSWKEN_DIS         ((uint32_t)0x0UL) /**< USB_WK_EN_USBVBUSWKEN_DIS Value */
#define MXC_S_PWRSEQ_USB_WK_EN_USBVBUSWKEN_DIS         (MXC_V_PWRSEQ_USB_WK_EN_USBVBUSWKEN_DIS << MXC_F_PWRSEQ_USB_WK_EN_USBVBUSWKEN_POS) /**< USB_WK_EN_USBVBUSWKEN_DIS Setting */
#define MXC_V_PWRSEQ_USB_WK_EN_USBVBUSWKEN_EN          ((uint32_t)0x1UL) /**< USB_WK_EN_USBVBUSWKEN_EN Value */
#define MXC_S_PWRSEQ_USB_WK_EN_USBVBUSWKEN_EN          (MXC_V_PWRSEQ_USB_WK_EN_USBVBUSWKEN_EN << MXC_F_PWRSEQ_USB_WK_EN_USBVBUSWKEN_POS) /**< USB_WK_EN_USBVBUSWKEN_EN Setting */

/**@} end of group PWRSEQ_USB_WK_EN_Register */

/**
 * @ingroup  pwrseq_registers
 * @defgroup PWRSEQ_MEM_PWR PWRSEQ_MEM_PWR
 * @brief    Low Power Memory Shutdown Control.
 * @{
 */
#define MXC_F_PWRSEQ_MEM_PWR_SRAM0SD_POS               0 /**< MEM_PWR_SRAM0SD Position */
#define MXC_F_PWRSEQ_MEM_PWR_SRAM0SD                   ((uint32_t)(0x1UL << MXC_F_PWRSEQ_MEM_PWR_SRAM0SD_POS)) /**< MEM_PWR_SRAM0SD Mask */
#define MXC_V_PWRSEQ_MEM_PWR_SRAM0SD_NORMAL            ((uint32_t)0x0UL) /**< MEM_PWR_SRAM0SD_NORMAL Value */
#define MXC_S_PWRSEQ_MEM_PWR_SRAM0SD_NORMAL            (MXC_V_PWRSEQ_MEM_PWR_SRAM0SD_NORMAL << MXC_F_PWRSEQ_MEM_PWR_SRAM0SD_POS) /**< MEM_PWR_SRAM0SD_NORMAL Setting */
#define MXC_V_PWRSEQ_MEM_PWR_SRAM0SD_SHUTDOWN          ((uint32_t)0x1UL) /**< MEM_PWR_SRAM0SD_SHUTDOWN Value */
#define MXC_S_PWRSEQ_MEM_PWR_SRAM0SD_SHUTDOWN          (MXC_V_PWRSEQ_MEM_PWR_SRAM0SD_SHUTDOWN << MXC_F_PWRSEQ_MEM_PWR_SRAM0SD_POS) /**< MEM_PWR_SRAM0SD_SHUTDOWN Setting */

#define MXC_F_PWRSEQ_MEM_PWR_SRAM1SD_POS               1 /**< MEM_PWR_SRAM1SD Position */
#define MXC_F_PWRSEQ_MEM_PWR_SRAM1SD                   ((uint32_t)(0x1UL << MXC_F_PWRSEQ_MEM_PWR_SRAM1SD_POS)) /**< MEM_PWR_SRAM1SD Mask */
#define MXC_V_PWRSEQ_MEM_PWR_SRAM1SD_NORMAL            ((uint32_t)0x0UL) /**< MEM_PWR_SRAM1SD_NORMAL Value */
#define MXC_S_PWRSEQ_MEM_PWR_SRAM1SD_NORMAL            (MXC_V_PWRSEQ_MEM_PWR_SRAM1SD_NORMAL << MXC_F_PWRSEQ_MEM_PWR_SRAM1SD_POS) /**< MEM_PWR_SRAM1SD_NORMAL Setting */
#define MXC_V_PWRSEQ_MEM_PWR_SRAM1SD_SHUTDOWN          ((uint32_t)0x1UL) /**< MEM_PWR_SRAM1SD_SHUTDOWN Value */
#define MXC_S_PWRSEQ_MEM_PWR_SRAM1SD_SHUTDOWN          (MXC_V_PWRSEQ_MEM_PWR_SRAM1SD_SHUTDOWN << MXC_F_PWRSEQ_MEM_PWR_SRAM1SD_POS) /**< MEM_PWR_SRAM1SD_SHUTDOWN Setting */

#define MXC_F_PWRSEQ_MEM_PWR_SRAM2SD_POS               2 /**< MEM_PWR_SRAM2SD Position */
#define MXC_F_PWRSEQ_MEM_PWR_SRAM2SD                   ((uint32_t)(0x1UL << MXC_F_PWRSEQ_MEM_PWR_SRAM2SD_POS)) /**< MEM_PWR_SRAM2SD Mask */
#define MXC_V_PWRSEQ_MEM_PWR_SRAM2SD_NORMAL            ((uint32_t)0x0UL) /**< MEM_PWR_SRAM2SD_NORMAL Value */
#define MXC_S_PWRSEQ_MEM_PWR_SRAM2SD_NORMAL            (MXC_V_PWRSEQ_MEM_PWR_SRAM2SD_NORMAL << MXC_F_PWRSEQ_MEM_PWR_SRAM2SD_POS) /**< MEM_PWR_SRAM2SD_NORMAL Setting */
#define MXC_V_PWRSEQ_MEM_PWR_SRAM2SD_SHUTDOWN          ((uint32_t)0x1UL) /**< MEM_PWR_SRAM2SD_SHUTDOWN Value */
#define MXC_S_PWRSEQ_MEM_PWR_SRAM2SD_SHUTDOWN          (MXC_V_PWRSEQ_MEM_PWR_SRAM2SD_SHUTDOWN << MXC_F_PWRSEQ_MEM_PWR_SRAM2SD_POS) /**< MEM_PWR_SRAM2SD_SHUTDOWN Setting */

#define MXC_F_PWRSEQ_MEM_PWR_SRAM3SD_POS               3 /**< MEM_PWR_SRAM3SD Position */
#define MXC_F_PWRSEQ_MEM_PWR_SRAM3SD                   ((uint32_t)(0x1UL << MXC_F_PWRSEQ_MEM_PWR_SRAM3SD_POS)) /**< MEM_PWR_SRAM3SD Mask */
#define MXC_V_PWRSEQ_MEM_PWR_SRAM3SD_NORMAL            ((uint32_t)0x0UL) /**< MEM_PWR_SRAM3SD_NORMAL Value */
#define MXC_S_PWRSEQ_MEM_PWR_SRAM3SD_NORMAL            (MXC_V_PWRSEQ_MEM_PWR_SRAM3SD_NORMAL << MXC_F_PWRSEQ_MEM_PWR_SRAM3SD_POS) /**< MEM_PWR_SRAM3SD_NORMAL Setting */
#define MXC_V_PWRSEQ_MEM_PWR_SRAM3SD_SHUTDOWN          ((uint32_t)0x1UL) /**< MEM_PWR_SRAM3SD_SHUTDOWN Value */
#define MXC_S_PWRSEQ_MEM_PWR_SRAM3SD_SHUTDOWN          (MXC_V_PWRSEQ_MEM_PWR_SRAM3SD_SHUTDOWN << MXC_F_PWRSEQ_MEM_PWR_SRAM3SD_POS) /**< MEM_PWR_SRAM3SD_SHUTDOWN Setting */

#define MXC_F_PWRSEQ_MEM_PWR_SRAM4SD_POS               4 /**< MEM_PWR_SRAM4SD Position */
#define MXC_F_PWRSEQ_MEM_PWR_SRAM4SD                   ((uint32_t)(0x1UL << MXC_F_PWRSEQ_MEM_PWR_SRAM4SD_POS)) /**< MEM_PWR_SRAM4SD Mask */
#define MXC_V_PWRSEQ_MEM_PWR_SRAM4SD_NORMAL            ((uint32_t)0x0UL) /**< MEM_PWR_SRAM4SD_NORMAL Value */
#define MXC_S_PWRSEQ_MEM_PWR_SRAM4SD_NORMAL            (MXC_V_PWRSEQ_MEM_PWR_SRAM4SD_NORMAL << MXC_F_PWRSEQ_MEM_PWR_SRAM4SD_POS) /**< MEM_PWR_SRAM4SD_NORMAL Setting */
#define MXC_V_PWRSEQ_MEM_PWR_SRAM4SD_SHUTDOWN          ((uint32_t)0x1UL) /**< MEM_PWR_SRAM4SD_SHUTDOWN Value */
#define MXC_S_PWRSEQ_MEM_PWR_SRAM4SD_SHUTDOWN          (MXC_V_PWRSEQ_MEM_PWR_SRAM4SD_SHUTDOWN << MXC_F_PWRSEQ_MEM_PWR_SRAM4SD_POS) /**< MEM_PWR_SRAM4SD_SHUTDOWN Setting */

#define MXC_F_PWRSEQ_MEM_PWR_SRAM5SD_POS               5 /**< MEM_PWR_SRAM5SD Position */
#define MXC_F_PWRSEQ_MEM_PWR_SRAM5SD                   ((uint32_t)(0x1UL << MXC_F_PWRSEQ_MEM_PWR_SRAM5SD_POS)) /**< MEM_PWR_SRAM5SD Mask */
#define MXC_V_PWRSEQ_MEM_PWR_SRAM5SD_NORMAL            ((uint32_t)0x0UL) /**< MEM_PWR_SRAM5SD_NORMAL Value */
#define MXC_S_PWRSEQ_MEM_PWR_SRAM5SD_NORMAL            (MXC_V_PWRSEQ_MEM_PWR_SRAM5SD_NORMAL << MXC_F_PWRSEQ_MEM_PWR_SRAM5SD_POS) /**< MEM_PWR_SRAM5SD_NORMAL Setting */
#define MXC_V_PWRSEQ_MEM_PWR_SRAM5SD_SHUTDOWN          ((uint32_t)0x1UL) /**< MEM_PWR_SRAM5SD_SHUTDOWN Value */
#define MXC_S_PWRSEQ_MEM_PWR_SRAM5SD_SHUTDOWN          (MXC_V_PWRSEQ_MEM_PWR_SRAM5SD_SHUTDOWN << MXC_F_PWRSEQ_MEM_PWR_SRAM5SD_POS) /**< MEM_PWR_SRAM5SD_SHUTDOWN Setting */

#define MXC_F_PWRSEQ_MEM_PWR_SRAM6SD_POS               6 /**< MEM_PWR_SRAM6SD Position */
#define MXC_F_PWRSEQ_MEM_PWR_SRAM6SD                   ((uint32_t)(0x1UL << MXC_F_PWRSEQ_MEM_PWR_SRAM6SD_POS)) /**< MEM_PWR_SRAM6SD Mask */
#define MXC_V_PWRSEQ_MEM_PWR_SRAM6SD_NORMAL            ((uint32_t)0x0UL) /**< MEM_PWR_SRAM6SD_NORMAL Value */
#define MXC_S_PWRSEQ_MEM_PWR_SRAM6SD_NORMAL            (MXC_V_PWRSEQ_MEM_PWR_SRAM6SD_NORMAL << MXC_F_PWRSEQ_MEM_PWR_SRAM6SD_POS) /**< MEM_PWR_SRAM6SD_NORMAL Setting */
#define MXC_V_PWRSEQ_MEM_PWR_SRAM6SD_SHUTDOWN          ((uint32_t)0x1UL) /**< MEM_PWR_SRAM6SD_SHUTDOWN Value */
#define MXC_S_PWRSEQ_MEM_PWR_SRAM6SD_SHUTDOWN          (MXC_V_PWRSEQ_MEM_PWR_SRAM6SD_SHUTDOWN << MXC_F_PWRSEQ_MEM_PWR_SRAM6SD_POS) /**< MEM_PWR_SRAM6SD_SHUTDOWN Setting */

#define MXC_F_PWRSEQ_MEM_PWR_ICACHESD_POS              7 /**< MEM_PWR_ICACHESD Position */
#define MXC_F_PWRSEQ_MEM_PWR_ICACHESD                  ((uint32_t)(0x1UL << MXC_F_PWRSEQ_MEM_PWR_ICACHESD_POS)) /**< MEM_PWR_ICACHESD Mask */
#define MXC_V_PWRSEQ_MEM_PWR_ICACHESD_NORMAL           ((uint32_t)0x0UL) /**< MEM_PWR_ICACHESD_NORMAL Value */
#define MXC_S_PWRSEQ_MEM_PWR_ICACHESD_NORMAL           (MXC_V_PWRSEQ_MEM_PWR_ICACHESD_NORMAL << MXC_F_PWRSEQ_MEM_PWR_ICACHESD_POS) /**< MEM_PWR_ICACHESD_NORMAL Setting */
#define MXC_V_PWRSEQ_MEM_PWR_ICACHESD_SHUTDOWN         ((uint32_t)0x1UL) /**< MEM_PWR_ICACHESD_SHUTDOWN Value */
#define MXC_S_PWRSEQ_MEM_PWR_ICACHESD_SHUTDOWN         (MXC_V_PWRSEQ_MEM_PWR_ICACHESD_SHUTDOWN << MXC_F_PWRSEQ_MEM_PWR_ICACHESD_POS) /**< MEM_PWR_ICACHESD_SHUTDOWN Setting */

#define MXC_F_PWRSEQ_MEM_PWR_ICACHEXIPSD_POS           8 /**< MEM_PWR_ICACHEXIPSD Position */
#define MXC_F_PWRSEQ_MEM_PWR_ICACHEXIPSD               ((uint32_t)(0x1UL << MXC_F_PWRSEQ_MEM_PWR_ICACHEXIPSD_POS)) /**< MEM_PWR_ICACHEXIPSD Mask */
#define MXC_V_PWRSEQ_MEM_PWR_ICACHEXIPSD_NORMAL        ((uint32_t)0x0UL) /**< MEM_PWR_ICACHEXIPSD_NORMAL Value */
#define MXC_S_PWRSEQ_MEM_PWR_ICACHEXIPSD_NORMAL        (MXC_V_PWRSEQ_MEM_PWR_ICACHEXIPSD_NORMAL << MXC_F_PWRSEQ_MEM_PWR_ICACHEXIPSD_POS) /**< MEM_PWR_ICACHEXIPSD_NORMAL Setting */
#define MXC_V_PWRSEQ_MEM_PWR_ICACHEXIPSD_SHUTDOWN      ((uint32_t)0x1UL) /**< MEM_PWR_ICACHEXIPSD_SHUTDOWN Value */
#define MXC_S_PWRSEQ_MEM_PWR_ICACHEXIPSD_SHUTDOWN      (MXC_V_PWRSEQ_MEM_PWR_ICACHEXIPSD_SHUTDOWN << MXC_F_PWRSEQ_MEM_PWR_ICACHEXIPSD_POS) /**< MEM_PWR_ICACHEXIPSD_SHUTDOWN Setting */

#define MXC_F_PWRSEQ_MEM_PWR_SCACHESD_POS              9 /**< MEM_PWR_SCACHESD Position */
#define MXC_F_PWRSEQ_MEM_PWR_SCACHESD                  ((uint32_t)(0x1UL << MXC_F_PWRSEQ_MEM_PWR_SCACHESD_POS)) /**< MEM_PWR_SCACHESD Mask */
#define MXC_V_PWRSEQ_MEM_PWR_SCACHESD_NORMAL           ((uint32_t)0x0UL) /**< MEM_PWR_SCACHESD_NORMAL Value */
#define MXC_S_PWRSEQ_MEM_PWR_SCACHESD_NORMAL           (MXC_V_PWRSEQ_MEM_PWR_SCACHESD_NORMAL << MXC_F_PWRSEQ_MEM_PWR_SCACHESD_POS) /**< MEM_PWR_SCACHESD_NORMAL Setting */
#define MXC_V_PWRSEQ_MEM_PWR_SCACHESD_SHUTDOWN         ((uint32_t)0x1UL) /**< MEM_PWR_SCACHESD_SHUTDOWN Value */
#define MXC_S_PWRSEQ_MEM_PWR_SCACHESD_SHUTDOWN         (MXC_V_PWRSEQ_MEM_PWR_SCACHESD_SHUTDOWN << MXC_F_PWRSEQ_MEM_PWR_SCACHESD_POS) /**< MEM_PWR_SCACHESD_SHUTDOWN Setting */

