analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/pwrseq_regs.h
#define MXC_F_PWRSEQ_MEM_PWR_CRYPTOSD_POS              10 /**< MEM_PWR_CRYPTOSD Position */
#define MXC_F_PWRSEQ_MEM_PWR_CRYPTOSD                  ((uint32_t)(0x1UL << MXC_F_PWRSEQ_MEM_PWR_CRYPTOSD_POS)) /**< MEM_PWR_CRYPTOSD Mask */
#define MXC_V_PWRSEQ_MEM_PWR_CRYPTOSD_NORMAL           ((uint32_t)0x0UL) /**< MEM_PWR_CRYPTOSD_NORMAL Value */
#define MXC_S_PWRSEQ_MEM_PWR_CRYPTOSD_NORMAL           (MXC_V_PWRSEQ_MEM_PWR_CRYPTOSD_NORMAL << MXC_F_PWRSEQ_MEM_PWR_CRYPTOSD_POS) /**< MEM_PWR_CRYPTOSD_NORMAL Setting */
#define MXC_V_PWRSEQ_MEM_PWR_CRYPTOSD_SHUTDOWN         ((uint32_t)0x1UL) /**< MEM_PWR_CRYPTOSD_SHUTDOWN Value */
#define MXC_S_PWRSEQ_MEM_PWR_CRYPTOSD_SHUTDOWN         (MXC_V_PWRSEQ_MEM_PWR_CRYPTOSD_SHUTDOWN << MXC_F_PWRSEQ_MEM_PWR_CRYPTOSD_POS) /**< MEM_PWR_CRYPTOSD_SHUTDOWN Setting */

#define MXC_F_PWRSEQ_MEM_PWR_USBFIFOSD_POS             11 /**< MEM_PWR_USBFIFOSD Position */
#define MXC_F_PWRSEQ_MEM_PWR_USBFIFOSD                 ((uint32_t)(0x1UL << MXC_F_PWRSEQ_MEM_PWR_USBFIFOSD_POS)) /**< MEM_PWR_USBFIFOSD Mask */
#define MXC_V_PWRSEQ_MEM_PWR_USBFIFOSD_NORMAL          ((uint32_t)0x0UL) /**< MEM_PWR_USBFIFOSD_NORMAL Value */
#define MXC_S_PWRSEQ_MEM_PWR_USBFIFOSD_NORMAL          (MXC_V_PWRSEQ_MEM_PWR_USBFIFOSD_NORMAL << MXC_F_PWRSEQ_MEM_PWR_USBFIFOSD_POS) /**< MEM_PWR_USBFIFOSD_NORMAL Setting */
#define MXC_V_PWRSEQ_MEM_PWR_USBFIFOSD_SHUTDOWN        ((uint32_t)0x1UL) /**< MEM_PWR_USBFIFOSD_SHUTDOWN Value */
#define MXC_S_PWRSEQ_MEM_PWR_USBFIFOSD_SHUTDOWN        (MXC_V_PWRSEQ_MEM_PWR_USBFIFOSD_SHUTDOWN << MXC_F_PWRSEQ_MEM_PWR_USBFIFOSD_POS) /**< MEM_PWR_USBFIFOSD_SHUTDOWN Setting */

#define MXC_F_PWRSEQ_MEM_PWR_ROMSD_POS                 12 /**< MEM_PWR_ROMSD Position */
#define MXC_F_PWRSEQ_MEM_PWR_ROMSD                     ((uint32_t)(0x1UL << MXC_F_PWRSEQ_MEM_PWR_ROMSD_POS)) /**< MEM_PWR_ROMSD Mask */
#define MXC_V_PWRSEQ_MEM_PWR_ROMSD_NORMAL              ((uint32_t)0x0UL) /**< MEM_PWR_ROMSD_NORMAL Value */
#define MXC_S_PWRSEQ_MEM_PWR_ROMSD_NORMAL              (MXC_V_PWRSEQ_MEM_PWR_ROMSD_NORMAL << MXC_F_PWRSEQ_MEM_PWR_ROMSD_POS) /**< MEM_PWR_ROMSD_NORMAL Setting */
#define MXC_V_PWRSEQ_MEM_PWR_ROMSD_SHUTDOWN            ((uint32_t)0x1UL) /**< MEM_PWR_ROMSD_SHUTDOWN Value */
#define MXC_S_PWRSEQ_MEM_PWR_ROMSD_SHUTDOWN            (MXC_V_PWRSEQ_MEM_PWR_ROMSD_SHUTDOWN << MXC_F_PWRSEQ_MEM_PWR_ROMSD_POS) /**< MEM_PWR_ROMSD_SHUTDOWN Setting */

/**@} end of group PWRSEQ_MEM_PWR_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32650_INCLUDE_PWRSEQ_REGS_H_
